/*Το AMKA έχει την ακόλουθη 11-ψήφια μορφή: YYMMDDxxxyz, 
όπου τα πρώτα 6 ψηφία κωδικοποιούν την ημερομηνία γέννησης του ατόμου (YYMMDD),
τα ακόλουθα 4 ψηφία είναι ένας αριθμός ακολουθίας των ατόμων που γεννήθηκαν εκείνη την ημερομηνία (xxxy)
και το τελευταίο ψηφίο είναι ένα στοιχείο ελέγχου ψηφίο (z).
Το φύλο του ατόμου κωδικοποιείται στο τελευταίο ψηφίο του αριθμού ακολουθίας (y του xxxy):
αντιστοιχίζονται ακόμη και ψηφία σε γυναίκες και περίεργα ψηφία αντιστοιχίζονται σε άνδρες*/

// 09037902450

function amkacheck() {   
    let amka = $('#input_amka').val();
    let amka_length = $('#input_amka').val().length;
    if((amka_length !== 11) || (amka == 00000000000)){
        //Το ΑΜΚΑ που δώσατε δεν είναι έγκυρο
        return false
    } 
    else{
        amka = parseInt(amka);
        if(luhnCheck(amka)){
            return true //Το ΑΜΚΑ που δώσατε είναι έγκυρο
        }
        else{
            //Το ΑΜΚΑ που δώσατε δεν είναι έγκυρο
            return false
        }
    }
   
}





