/*Το AMKA έχει την ακόλουθη 11-ψήφια μορφή: YYMMDDxxxyz, 
όπου τα πρώτα 6 ψηφία κωδικοποιούν την ημερομηνία γέννησης του ατόμου (YYMMDD),
τα ακόλουθα 4 ψηφία είναι ένας αριθμός ακολουθίας των ατόμων που γεννήθηκαν εκείνη την ημερομηνία (xxxy)
και το τελευταίο ψηφίο είναι ένα στοιχείο ελέγχου ψηφίο (z).
Το φύλο του ατόμου κωδικοποιείται στο τελευταίο ψηφίο του αριθμού ακολουθίας (y του xxxy):
αντιστοιχίζονται ακόμη και ψηφία σε γυναίκες και περίεργα ψηφία αντιστοιχίζονται σε άνδρες*/
let amka;
//  function to get user input for amka
function getamka(){
    amka = $('#input_amka').val();
    return amka.toString();  
}
function amkacheck() {   
    if((amka.length !== 11) || (amka == "00000000000")){
        //Το ΑΜΚΑ που δώσατε δεν είναι έγκυρο
        return false
    } 
    else{
        if(luhnCheck(amka)){
            return true //Το ΑΜΚΑ που δώσατε είναι έγκυρο
        }
        else{
            //Το ΑΜΚΑ που δώσατε δεν είναι έγκυρο
            return false
        }
    }
}






